magicc-safety/Veloxity/tools/espnow_uart_bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_BRIDGE_PACKET_PAYLOAD_MAX=200
CONFIG_BRIDGE_QUEUE_DEPTH=32
CONFIG_BRIDGE_SEND_TIMEOUT_MS=100
CONFIG_BRIDGE_TASK_STACK=8192
# CONFIG_BRIDGE_CONFIGURE_ESPNOW_RATE is not set
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP_WIFI_RX_BA_WIN=16
